app/controllers/admins/sites_controller.rb

  def create
  	@item = Item.new(item_params)
  	@item.client = current_client
  	# @genre = Genre.find(@item.genre_id)
  	@item.save!
---
INSERT INTO "items" ("name", "price", "genre_id", "introduction", "item_image_id", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def top
  	@items = Item.all.order(created_at: :desc).where(is_active: 1).page(params[:page]).per(18)
  	@genres = Genre.all
    now = Time.current
    # ranking = Post.where.group(:item_id).order("avg(posts.rate) desc").limit(3).pluck("item_id,avg(posts.rate)")
    # group(:item_id)→item_idが同じものにグルーピング　order("avg(posts.rate) desc")→postsの評価の平均値を昇順に並び替え
    # pluck("item_id,avg(posts.rate)")→pluckは取得するカラムを複数指定する事が出来,最後に置く。今回はitem_idと評価の平均値を取得
    # pluck("item_id,avg(posts.rate)")は配列で0番目がitem_id、1番目に平均値を表示。mapでitemとaverageの情報を引き出している
    monthly_ranking  = Post.where(created_at: Time.now.all_month).group(:item_id).order("avg(posts.rate) desc").limit(3).pluck("item_id,avg(posts.rate)")
    @monthly_ranking = monthly_ranking.map do |r|
      {
        item:Item.find(r[0]),
        average:r[1]
      }
    end

    weekly_ranking = Post.where(created_at: Time.now.all_week).group(:item_id).order("avg(posts.rate) desc").limit(3).pluck("item_id,avg(posts.rate)")
    @weekly_ranking = weekly_ranking.map do |r|
      {
        item:Item.find(r[0]),
        average:r[1]
      }
    end
    daily_ranking = Post.where(created_at: Time.now.all_day).group(:item_id).order("avg(posts.rate) desc").limit(3).pluck("item_id,avg(posts.rate)")
    @daily_ranking = daily_ranking.map do |r|
      {
        item:Item.find(r[0]),
        average:r[1]
---
SELECT "genres".* FROM "genres"
SELECT  item_id,avg(posts.rate) FROM "posts" WHERE "posts"."created_at" BETWEEN ? AND ? GROUP BY "posts"."item_id" ORDER BY avg(posts.rate) desc LIMIT ?  [["created_at", "2020-09-01 00:00:00"], ["created_at", "2020-09-30 23:59:59.999999"], ["LIMIT", 3]]
SELECT AVG("posts"."rate") FROM "posts"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  item_id,avg(posts.rate) FROM "posts" WHERE "posts"."created_at" BETWEEN ? AND ? GROUP BY "posts"."item_id" ORDER BY avg(posts.rate) desc LIMIT ?  [["created_at", "2020-09-14 00:00:00"], ["created_at", "2020-09-20 23:59:59.999999"], ["LIMIT", 3]]
SELECT  item_id,avg(posts.rate) FROM "posts" WHERE "posts"."created_at" BETWEEN ? AND ? GROUP BY "posts"."item_id" ORDER BY avg(posts.rate) desc LIMIT ?  [["created_at", "2020-09-16 00:00:00"], ["created_at", "2020-09-16 23:59:59.999999"], ["LIMIT", 3]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  item_id,avg(posts.rate) FROM "posts" WHERE "posts"."created_at" BETWEEN ? AND ? GROUP BY "posts"."item_id" ORDER BY avg(posts.rate) desc LIMIT ?  [["created_at", "2020-09-17 00:00:00"], ["created_at", "2020-09-17 23:59:59.999999"], ["LIMIT", 3]]