app/controllers/admins/sites_controller.rb

  def top
  	@items = Item.all
---
SELECT "items".* FROM "items"