app/views/clients/orders/_order_items_render.html.erb

            <% order_details.each do |order_detail| %>
            <% @item = Item.find(order_detail.item_id) %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]