app/controllers/customers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" = ? AND "cart_items"."customer_id" = ? LIMIT ?  [["item_id", 1], ["customer_id", 1], ["LIMIT", 1]]
---
  def index
    	@cart_items = @customer.cart_items.all

INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 2], ["created_at", "2020-09-08 11:47:10.682589"], ["updated_at", "2020-09-08 11:47:10.682589"]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" = ? AND "cart_items"."customer_id" = ? LIMIT ?  [["item_id", 1], ["customer_id", 1], ["LIMIT", 1]]
---
  def create
  	# @item = Item.find(params[:cart_item][:id])
  	@cart_item = current_customer.cart_items.new(cart_item_params)
  	@cart_item.save!
  	redirect_to customers_cart_items_path
  	@current_item = CartItem.find_by(item_id: @cart_item.item_id, customer_id: @cart_item.customer_id)

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def update
  	@cart_items = current_customer.cart_items.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["customer_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def destroy
  	@cart_items = current_customer.cart_items.find(params[:id])
  	@cart_items.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def set_cart_item
  	@cart_item = CartItem.find(params[:id])