app/controllers/customers/customer_controller.rb

def edit
  @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

def update
  @customer = Customer.find(params[:id])
  if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "last_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["last_name_kana", "ok"], ["updated_at", "2020-09-14 09:20:34.314129"], ["id", 1]]