app/controllers/customers/items_controller.rb

  def index
  	if  params[:genre_id]
  		@genre = Genre.find(params[:genre_id])
  		@items = @genre.items
  	else
  	   @items = Item.all
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 2]]

  def show
  	@item = Item.find(params[:id])
  	@genre = Genre.find(@item.genre_id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]