app/controllers/customers/items_controller.rb

  def index
  	if  params[:genre_id]
  		@genre = Genre.find(params[:genre_id]).where(is_active: 1)
  		@items = @genre.items
  	else
  	   @items = Item.where(is_active: 1)
---
SELECT "items".* FROM "items" WHERE "items"."is_active" = ?  [["is_active", 1]]