app/controllers/customers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
---
			def index
				@orders = @customer.orders

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."customer_id" = ? LIMIT ?  [["customer_id", 1], ["LIMIT", 1]]
---
			def create
				if current_customer.cart_items.exists?

					@order = Order.new(order_params)
					@order.customer_id = current_customer.id
					@order.payment_method = params[:order][:payment_method]

		      # 合計金額を求める
		      sum_all = 0
		      cart_item = current_customer.cart_items
		      cart_item.each do |ci|

INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "total_payment", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
		          address.address      = @order.address
		          address.destination  = @order.name
		          address.postal_code  = @order.postal_code
		          address.save
		      end
		      @order.save!

INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 3], ["item_id", 1], ["price", 300], ["amount", 2], ["created_at", "2020-09-09 13:16:47.567852"], ["updated_at", "2020-09-09 13:16:47.567852"]]
---
		      	order_details.item_id      = ci.item_id
		      	order_details.price        = ci.item.price
		      	order_details.amount       = ci.amount
		      	order_details.save

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
		def new
			current_customer_cart = current_customer.cart_items
			if current_customer_cart.blank?

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
		def confirm
			@order = Order.new
			@cart_items = current_customer.cart_items.all
			@order.payment_method = params[:order][:payment_method]

		    # 合計金額を求める
		    sum_all = 0
		    @cart_items.each do |ci|