app/controllers/customers/posts_controller.rb

INSERT INTO "posts" ("customer_id", "item_id", "rate", "created_at", "updated_at", "content", "title") VALUES (?, ?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["item_id", 2], ["rate", 4.0], ["created_at", "2020-09-14 12:32:35.015045"], ["updated_at", "2020-09-14 12:32:35.015045"], ["content", "ok"], ["title", "Rails"]]
---
  def create
  	@post = Post.new(post_params)
  	@post.customer_id = current_customer.id
  	@post.save!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "ieieie"], ["updated_at", "2020-09-14 14:37:07.134729"], ["id", 1]]
---
  def update
  	@post = Post.find(params[:id])
  	@post.update(post_params)