app/views/customers/orders/index.html.erb

          <th>
            <% order.order_details.each do |od| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]