app/views/customers/orders/show.html.erb

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]
---
      <% sum_all = 0 %>
      <% @order.order_details.each do |od| %>