app/views/admins/sites/new.html.erb

SELECT "genres".* FROM "genres" WHERE "genres"."is_active" = ?  [["is_active", 1]]
---
<%= f.label :ジャンル名 %>
<%= f.collection_select :genre_id, Genre.where(is_active: 1), :id, :name, include_blank: "選択して下さい" %>