app/controllers/clients/genres_controller.rb

  def update
  	@genre = Genre.find(params[:id])
  	if @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "is_active" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["is_active", 0], ["updated_at", "2020-09-12 03:57:42.774080"], ["id", 1]]