app/controllers/clients/items_controller.rb

  def index
  	@items = Item.where(client_id: current_client)
---
SELECT "items".* FROM "items" WHERE "items"."client_id" = ?  [["client_id", 1]]

  def show
  	@item = Item.find(params[:id])
    @genre = Genre.find(@item.genre_id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
  	@item = Item.new(item_params)
  	@item.client = current_client
  	@item.save!
---
INSERT INTO "items" ("name", "price", "genre_id", "introduction", "item_image_id", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "items" SET "item_image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["item_image_id", "d86a3d9c72881300bf288a9e81306124e472bef2de01a4308387ecb17f53"], ["updated_at", "2020-09-10 04:06:32.076275"], ["id", 6]]