app/controllers/clients/orders_controller.rb

    def index
        case params[:order_sort]
            when "0"
                @orders = Order.where(created_at: Time.zone.now.all_day)
            when "1"
                @customer = Customer.find(params[:id])
                @orders = @customer.orders
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"

    def show
        @order = Order.find(params[:id])
        @customer = Customer.find(@order.customer_id)
        @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]